---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.CalculateLinesPerLength
source: html/4e9ac116-b8e9-8de3-ca68-9ea63ae81cbf.htm
---
# Autodesk.Revit.DB.FillGrid.CalculateLinesPerLength Method

Calculates the number of solid lines of the pattern per unit length.

## Syntax (C#)
```csharp
public double CalculateLinesPerLength()
```

## Returns
The solid lines per length.